[{"title":"昭奚旧草  2016-12-26","date":"2016-12-25T22:31:20.000Z","path":"2016/12/26/zhaoxijiucao/","text":"“他是我的心上人，这才是他做对的唯一的一件事。你瞧他不过如此，可是在我眼中，他却是天地至美。而天地至美，本无常主。所以，他迟迟不属于我，也不属于任何一个人。” 一夜未眠，伴着音乐工作，忽然放到这首音乐，把我从一块块代码中拉到了另一个世界。 可能是现实生活的稀松平常会让一个人无法抵抗逃离现实的诱惑，将自己置身于那个俯身便可阅尽众生轮回的世界，停泊在泼墨笔尖。 “有怪踩月而来，美如秋水，清如山河，生呆若木鸡，爱而不能忍，甚倾之。” 爱到何处，已不能忍受咫尺之距。甚倾之。生甚倾之。 从不知相思，安知相思死。 “我与梦中的小小姑娘说，等她长大了，便带她去看悬崖上的红花、海底的白珠，欢喜她欢喜到打仗吃酒读书抚琴都忍不住带到身边，山高水长过一辈子。”“然后呢？”“然后，她死在了长大嫁人的那一日。” 他让她住在他的心上，走到哪里便带到哪里，记忆有多久，她便有多么长寿。 但凡人命，皆由天意妄肆而定，我不入红尘，此生不驯。 我也曾备下三十三城嫁妆，预备嫁我价值连城的掌珠。 “奚山，什么是命？”“就是任你万念俱灰死而复生，日夜不停绝望哭泣，也依旧拿它没有办法的东西啊。得不到的就是得不到，那样东西卑鄙地诱惑着你，背对着你却几乎笑得喘不过气，它对所有有资格得到它的人共享欢愉，共分秘密，一同看戏，看着你，而后转头告诉那些人，瞧，那个小傻子，也妄想得到我呢。” 她欢喜他，叶公好龙，他爱着她，尾生抱柱。 我只是想再瞧你一瞧，我怕再也瞧你不到。 更始十九年一个夏日的清晨，我卜了一卦，卦象安宁，说你还在。这一卦是我人生中唯一一次错了。卦象如此平静，除了可能是你一直活着，还有一种可能——你已不在很久。 君当如何，妾当如何。君是乱臣，妾做贼子。 三娘低声道：“我与山君不同。我喜欢的人若是也喜欢我，便只能喜欢我一人。哪怕他喜欢旁的女子只是一时一日，我也断然不会让他好受。他喜欢我不能是最喜欢，更不能只是浅浅的喜欢，最喜欢时还有次喜欢，浅浅喜欢我那深深喜欢又给了谁？他只能喜欢我。” 我长不大了，却在变老。时间是永恒的，我却在消耗。没有人知道我在等什么，我也不必让他们知道。他们看到我是笑着的，可是我难过的时候除了不停呼吸，已经蠢到不知道该干什么。你若了解苍穹之宽阔，便明白我抬头仰望时的悲渺。仿佛我生下来就是这样孤零零的，仿佛到现在，我还是这一个我。 没有瞧见她的时候，天下倒还是个天下的模样，她死了，天下变成了一桩桩琐事。 从此我活着仅仅是为了熬完最后的日子，不管二十岁还是六十岁。 君心何坚决，到死无两意。 他一直等着，待到下辈子，他与她不亏不欠了，便莫要欢喜过甚，钟情过疾，骄傲过命，只是结个良缘，也能好聚好散。 打散的，寂寞之徒；忘却的，年岁偶驻。 我的爱比别人廉价，满了便溢，没什么可惜。因我知终有一日，它还会满。 那是她失去了许久的东西，这世上再无人知道了，可只有她，一直这样艰难地铭记着。哪怕失去了味觉，失去了感情， 变成了一粒草籽，一片乌云，也钻心刺骨地无法忘记。 她这样深切痛苦地思念着他，是思念教她走到今日。 我得宠溺他一生一世，做个他，像他待我那一辈子。惟愿他，此生便是那个前世懵懂的我，被钟爱，被安排。虽则天常有不测风云。 我也曾想，我若为天，该有多好，定善待他终生。 我若为天，他的磨难中总存一线希望，痛苦中还有转圜。这世上神话故事颇多，每一桩，都是我来演。我来做山，做海，做泥荷，做蝼蚁，苍天有束光可偷，我也偷来，予他做个冠带。你何必惊讶他竟不能处处识得我，也不必知道，这样的强制安排不是为了满足我的爱，而是为了想要他还能笑出来。 “须知万物皆有少年早衰之时，焉知我便强过谁？”“你是我的妻子，自然强过这世间千千万。” 她知道他必定曾经在很遥远很遥远的时候，抱她入怀，那样珍重，那样怜爱。那或许是他们的前世，只有她记得的前世 。人说讲虚妄之事是因无知，只有忍冬知道，她划定了一个虚无的前世，只是因为太想得到。 她说：“我就此消失，祈求奚山君夺去我在你脑海中的记忆，这样，你此生，便可如高岭之雪，不受玷污，成为第一等诸侯，得到第一等封邑，娶得第一等娇妻，福寿双全。”风起云涌，屏风渐渐随着风化，屏风内的那张干净的面庞也随着屏风一寸寸变成沙尘。 她说：“谢良辰，我知道你觉得我配不上你，不该奢望。可是，你何曾配得上过我那样的喜欢？故而，打从今天，从这一刻钟，从我们初初见面的那一眼，从夏虫鸣了，桃花散了，竹叶青了的时候算起，我们两不相欠。” 本是深闺梦中人，日头月头霞光雾霰万象变幻，自哂自嘲自污自怨不自量力，不过是，怕人听见。 你怨我欢喜得卑鄙，欢喜得浅薄，可是你前生，又爱我到如何，才教我今生从头清算，迎头一棒，鲜血淋漓，这样去还。 她死的那一日，天上飞来许多雀鸟，那鸟儿眼瞧着就要自由。他让人打落了所有的鸟儿，葬在她的坟前，祭奠她此生可贵的自由，他此生卑微的囚途。 百国男子老老少少，我瞧见谁，一错眼一恍惚，便总是隐约觉得他们五官血脉中或多或少都有一丝一毫像着你，他们并不是你，我寻不到你，可他们像你。 爱太执着，恨太浓烈，她旧时候都尝过，可待到来年，它们就长成了遗憾。旧时景色，旧时人情，旧时琳琅，旧时凋零。满目疮痍，不忍目睹。 人世本就是一场游戏，你若已然输了，便不要再让对手赢了。成全没有任何意义，成全让恨意滋生，爱自己是活着的唯一意义，灰烬之后，才是田园斜径，白云出岫。 我想死到山涧，天地之间无人寻到，连鸟兽都不去的地方。这样尸体就能慢慢腐烂消散，不用与这来去都匆匆的人生一般。听闻骨头化得慢一些，可以慢慢等，等到灵魂都变成这空气的一部分，便能融入这世间，同这世间一般污浊了。到时候，再也没有人，为了求取我拥有的最后一样东西，而哄骗我，同我说这世间存有许多真情的假话了。 卧夜坐起风雨，推窗广厦明烛。天也有十分心愿，宁可千万人顺心如意。到头来，磨难重重；换一人，白首不离。 我有没有告诉过你，你是我看过最好看的男子？就算有人比你好看，可那也与我没什么相干。我说我讨厌你的时候，其实在想，这样待你是讨厌你，等我控制不住，待你再好一些的时候，你便不会再惧怕我，只会觉得我只是从讨厌你变成喜欢你罢了。 而非，从深深喜欢你到深深爱慕你。 大昭明珠生得极美，他带着千方百计，阴谋阳策，堪堪呼喝随身内侍扶正发间的那顶珠冠，也只是一垂头，含笑落泪。再抬起头，已是一目千里。可是他还是来不及，好好地，好好看她一眼。 火焰从翠衣人的脚边慢慢蹿起，天上却浮现了明亮的霞光。男子眼中无情无欲，只剩下悲悯。他临风而立，狂风吹起翠色的长袖。他说：“既已如此，三娘，莫再回头。你我夫妻缘尽，你莫回头瞧我，我亦不再瞧你。我入仙道，你入轮回，你我，再无相见，再无回头之日。” “世间有人爱我，有人憎我，有人说我对，有人说我错，如此，我当听哪一句？”“有某说你对，是因你所说之事合他心意。有某说你错，是因你所做之事与他所想相悖。说你对的许是你说了他不敢说的，承担了他不敢承担的，故而爱你，故而对你击节称赞，说穿了实在酸涩。说你错的许是你真的错了，因你之错太过明显，已暴露在诸人之中，而诸人皆是知道真相之人，他们不语，暗自看你笑话，那直接说你错的许是憎你，但你应谢他直言这一回。” 她用一双眼望着苍天，与它对视。 她说:“我幼小的时候，曾求你仁慈，后来长大了，便不再求你，因为我通晓了人事，知道求你也无用。求你只会让你嘲弄我、轻鄙我，求你只会让你知道我的弱点，知道我在乎什么。我的孩儿们小时候，我都曾拉着他们的小手，站在空旷的天地上，向你叩拜，我求你保佑他们好好长大，不要像我一样，我求你赐给他们快乐而勇敢的心，无论命运怎么捉弄都不会丧失希望。我所要的不多，并……不多啊。是啊，我输了，你赢了。我敌不过命运，我以人智，妄想换天。可是，那又如何？那又能怎样！” 先时我不信人间何物是长久的，亦总觉人与畜生无有不同，因人一生如此短暂，悟到什么，也只剩来不及。 “他是我的心上人，这才是他做对的唯一的一件事。你瞧他不过如此，可是在我眼中，他却是天地至美。而天地至美，本无常主。所以，他迟迟不属于我，也不属于任何一个人。” 你觉得活着费力，任凭谁也没好过多少。何苦生为人，人就是这样苦，你倘有本事，下辈子便托生为一块石头，那才妙。 我可能不曾告诉过你，我有一个哥哥，我那个哥哥死了。对，每个人都会死，他与别的人都一样，他也死了，他说他二十岁的时候，会送我嫁给这世上最好看的男子，可我等了三百年，却再也盼不到他二十岁了。但我想，我一定得达成他的愿望，我得嫁给这世上最好看的男子，我要我的夫君万世其昌，我要你好好的，好好的子孙满堂。 天下甚美。我还肯爱这山河，只是因为他还热切地爱着河山。 文中句子取自：《昭奚旧草》 摘抄：愿以百年挽朝夕","tags":[{"name":"音乐","slug":"音乐","permalink":"http://ev1l.cn/tags/音乐/"},{"name":"Leo","slug":"Leo","permalink":"http://ev1l.cn/tags/Leo/"}]},{"title":"你需要一个老头，帮助你理解下 Python 中的 yield","date":"2016-12-14T08:01:01.000Z","path":"2016/12/14/python_yield1/","text":"题外话 最初接触 Python 这门语言的时候，看的是《Python 核心编程》 迷迷糊糊的把 yield 这里看过去了，知道这个东西是用来造一个生成器用的，就一带而过了，日后的搬砖过程中也不知道怎么用这个家伙事儿。 我比较笨，学东西讨厌文档型说明（看不懂QAQ）。所以总是自己花很长时间去加工适合我的食物。 说起 yield，那这到底是个什么玩意？准备好了，我要开始背课文了：……从小脑袋不好使，记不住……还是编故事吧： 有个叫斐波那契的老头（也可能是女的，跟我有什么关系），提出了一个（不明白他搞出这东西要干啥的）数列定义（斐波那契数列）： 有一串数字，前两个是1，从第三个开始，每个数字都是它前两位数字的和。（1, 1, 2, 3, 5, 8, 13……） 提出定义的人我可以理解为他无聊，但是后来一群抠脚大汉开始对第N个数是多少那么感兴趣是什么鬼？这玩意算出来能干啥？（不知道） 不行，我也要凑热闹。（koujiao……） 123456def fab(max): n, a, b = 0, 0, 1 while n &lt; max: print b a, b = b, a + b n = n + 1 好，跑一下试试。123456&gt;&gt;&gt; fab(5)11235 结果是对的，你以为这就完了？隔壁王叔叔表示小伙子你这个写的有点问题啊，你这个直接print出来的，只能给我看，不能让我直接拿来用啊（你用它能干嘛？[手动黑人问号]）好，那就听您老的，给你返回一个 List 让你用（？？？）。12345678def fab(max): n, a, b = 0, 0, 1 list = [] while n &lt; max: list.append(b) a, b = b, a + b n = n + 1 return list 来，试一下。12345678&gt;&gt;&gt; for n in fab(5):... print n...11235 隔壁王叔叔的丈母娘（跟直系亲属姥姥不是一个人，谢谢)表示，小伙子你这个程序太特么占内存了，我输入大一点，这个List占用的内存都够我玩刺客信条大革命了（excuse me??)。 性能优化如果对python有一些了解的话，我们能很自然的想到一个经常拿来装逼的东西xrange。1234567# 1for i in range(1000): pass# 2for i in xrange(1000): pass 上面的两种写法，第一种是直接生成 1000个元素的List，相当于一次性给你一年的生活费。 而第二种是每次循环用到的时候给你一个，再用到再给你一个，可以理解为他有一个算式，每次你找他要钱他都要当场算算，然后给你一天的生活费。那用第二种方法吧。（看起来很扣的样子） 好，实现一个。12345678910111213141516class Fab(object): def __init__(self, max): self.max = max self.n, self.a, self.b = 0, 0, 1 def __iter__(self): return self def next(self): if self.n &lt; self.max: r = self.b self.a, self.b = self.b, self.a + self.b self.n = self.n + 1 return r raise StopIteration() 基础差的看不懂的，其实上面的代码就是定义了一个算法，你每次问我要一个数，我就当场算一个数，不会像上一个版本直接返回给你一个List。我们来调用一下：12345678&gt;&gt;&gt; for n in Fab(5):... print n...11235 嗯，成功了，这个版本性能是有了，可是隔壁王叔叔的侄女看了看代码不愿意了，帅哥（为什么要说出来？）你这个程序看着太复杂了啊，本来那么简单的代码怎么写的这么复杂啊？你这个人好复杂啊。 很好小姑娘，你要是王叔叔，我特么把你家网线煮了。看在你说的挺有道理的份上（其实是长得好看），我看看能不能简单点。 来，我们用一种高逼格的东西，兼顾简洁与性能，嘤嘤嘤。1234567def fab(max): n, a, b = 0, 0, 1 while n &lt; max: yield b # print b a, b = b, a + b n = n + 1 跟最初的第一个版本很像，注释掉了print b这句话，加上了 yield b。这里我们先调用下，看看结果。12345678&gt;&gt;&gt; for n in fab(5):... print n...11235 吹牛B模式已开启ok, 现在来回想下我们一路走过来，从最初的版本到使用yield之前，经历了哪些改动？仔细对照第一次的例子和这个使用yield的例子，好像差不多？再看看我们测试结果的代码有什么不同。就是这里了123456# 第一个例子fab(5)# yield例子for n in fab(5) print n 发现问题了吗？ fab(max) 函数中同样使用循环 一个使用 yield，另一个使用 print 打印 yield 例子，需要自己循环调用才能一个一个打印出来 这里我们推测yield使用上的特点： 暂停函数运行（要循环调用才管用） 再次调用能从上次暂停的地方继续执行函数（数列是连续的） 函数的每次运行都是遇到 yield 就停止并返回迭代值，下次再用时继续 对不起我编不下去了 据说还有更强大的使用方式，下次有机会研究研究写个续吧：） 隔壁王叔叔的儿子的小姨子表示小伙子，你再努努力，我就跟你跑了。 例子取自：廖雪峰-Python yield使用浅析","tags":[{"name":"python","slug":"python","permalink":"http://ev1l.cn/tags/python/"}]},{"title":"记python的一个坑","date":"2016-12-01T08:55:10.000Z","path":"2016/12/01/python_1/","text":"之前 python 的 server 出过一次问题，总是异常丢失数据。查日志也分析不出问题。 很困扰，最后一层一层找，发现是数据库返回的数据有重复列，到python端因为采用的是 index + data 分开存的方式（index: {name:1, age:2}, data:{‘zhangsan’, 23} 这样的两个集合），两个重复列名会导致index的对应出问题（字典无法存在两个相同 key）。我的问题是 index 的索引值超出了 data 的长度。 问题找到后，数据库端存储过程修改正确后这个奇怪的现象被我忽略了。后来今天看到了这么一段： 以下代码将输出什么?12list = ['a', 'b', 'c', 'd', 'e']print list[10:] 答案 以上代码将输出 []，并且不会导致一个 IndexError。 正如人们所期望的，试图访问一个超过列表索引值的成员将导致 IndexError（比如访问以上列表的 list[10]）。尽管如此，试图访问一个列表的以超出列表成员数作为开始索引的切片将不会导致 IndexError，并且将仅仅返回一个空列表。 一个讨厌的小问题是它会导致出现 bug ，并且这个问题是难以追踪的，因为它在运行时不会引发错误。 这原来是面试题里的送分题……这就尴尬了……","tags":[{"name":"python","slug":"python","permalink":"http://ev1l.cn/tags/python/"},{"name":"反人类","slug":"反人类","permalink":"http://ev1l.cn/tags/反人类/"}]},{"title":"分享一首歌","date":"2016-12-01T01:24:10.000Z","path":"2016/12/01/zyt/","text":"“是我先喜欢的你，所以你可以在我面前尽情的嚣张了。”“为什么要嚣张？” 你也许不会再出现在我的文字里了。其实你也有很久都没出现在我的文字里了：）","tags":[{"name":"音乐","slug":"音乐","permalink":"http://ev1l.cn/tags/音乐/"}]},{"title":"林宥嘉：她説好：)","date":"2016-11-29T15:56:00.000Z","path":"2016/11/29/林宥嘉：他説好：）/","text":"我不介意你慢动作我相信你正在与我相遇的路上马不停蹄所以当我拥抱整个世界的孤寂也像拥抱着你我不介意你慢动作也不介意这次先「擦肩而过」某天我们总会遇到对方然后说原来是你噢 -『致姗姗来迟的你』","tags":[{"name":"Leo","slug":"Leo","permalink":"http://ev1l.cn/tags/Leo/"}]}]